[
  {
    "imageURL": "https://cltarabyfa.cloudimg.io/https://cdn.soum.sa/homepage-assets/home_page_image_1.png?q=80",
    "title": "Soum, a Saudi-based online marketplace, successfully raises $18 million in its Series A funding round.",
    "briefSummary": "Soum, a Saudi-based online marketplace for secondhand products, has secured $18 million in a series A funding round led by Jahez, with participation from Isometry Capital and existing investors. Founded in 2021, Soum has seen rapid growth, achieving a 40-fold sales increase and surpassing 4 million app downloads in Saudi Arabia. The funding will support its expansion across the region and diversification into new product categories, aiming to capitalize on a market estimated at $40 billion.",
    "fullNewsURL": "https://www.arabnews.com/node/2429721/business-economy"
  },
  {
    "imageURL": "https://cltarabyfa.cloudimg.io/https://cdn.soum.sa/homepage-assets/home_page_image_2.jpeg?q=80",
    "title": "The Saudi e-commerce platform, Soum, secures $18 million in Series A funding.",
    "briefSummary": "Soum, a re-commerce platform based in Saudi Arabia, has raised $18 million in Series A funding led by Jahez Group to expand across the MENA region, starting with the UAE. Founded in 2021, Soum aims to broaden its product categories beyond electronics to include automobiles and collectibles, leveraging its streamlined marketplace model to enhance convenience and trust for users. The funding underscores Soum's strategic focus on capturing the growing demand for sustainable and cost-effective shopping solutions in the MENA re-commerce market.",
    "fullNewsURL": "https://techcrunch.com/2023/12/20/soum-18m-series-a-funding/"
  },
  {
    "imageURL": "https://cltarabyfa.cloudimg.io/https://www.arabianbusiness.com/cloud/2023/12/22/SOUM.jpg?q=80",
    "title": "In a Series A round, Saudi Arabia's online marketplace, Soum, garners $18 million.",
    "briefSummary": "Soum, based in Riyadh, has secured $18 million in Series A funding led by Jahez, with participation from Isometry Capital and existing investors Khwarizmi Ventures, Alrajhi Partners, and Outliers Venture Capital. Founded by Fahad Al Hassan, Bader Almubarak, and Fahad Albassam in 2021, Soum has rapidly grown its marketplace for secondhand products, achieving a 40-fold increase in sales and expanding its presence across Saudi Arabia and the UAE. This funding will support Soum's regional expansion and diversification into new product categories, aiming to tap into a $40 billion market across the MENA region.",
    "fullNewsURL": "https://www.arabianbusiness.com/industries/retail/riyadh-based-secondhand-products-marketplace-soum-raises-18mn-eyes-40bn-mena-market"
  },
  {
    "imageURL": "https://cltarabyfa.cloudimg.io/https://cdn.soum.sa/homepage-assets/home_page_image_4.jpeg?q=80",
    "title": "Soum, a leading Saudi marketplace, has closed its Series A funding round with $18 million raised",
    "briefSummary": "Saudi Arabia-based used-electronics platform Soum has raised $18 million in a Series A funding round, the company announced in a LinkedIn post on Thursday.",
    "fullNewsURL": "https://www.dealstreetasia.com/stories/saudi-arabia-soum-series-a-376449"
  },
  {
    "imageURL": "https://cltarabyfa.cloudimg.io/https://www.arabnews.com/sites/default/files/styles/n_670_395/public/2022/03/16/3123836-1385159019.png?itok=GqNSeKqK?q=80",
    "title": "The online marketplace Soum, headquartered in Saudi Arabia, raises $18m in a Series A round.",
    "briefSummary": "Soum, a Saudi ecommerce startup launched in 2021, has raised $4 million in a seed funding round led by Outliers Venture Capital and Mazen Al-Jubeir. Specializing in the resale of electronic devices, Soum aims to leverage its early growth to expand operations and solidify its position in the market. The funding also includes support from Khwarizmi Ventures, Ammar Al-Khudairy, and several angel investors, signaling confidence in Soum's potential within the ecommerce sector.",
    "fullNewsURL": "https://www.arabnews.com/node/2043761/business-economy"
  },
  {
    "imageURL": "https://cltarabyfa.cloudimg.io/https://cdn.soum.sa/homepage-assets/home_page_image_3.jpeg?q=80",
    "title": "Saudi Arabia’s Soum finalizes an $18 million Series A funding round.",
    "briefSummary": "Soum, a Saudi platform for buying and selling secondhand goods, has secured $18 million in Series A funding led by Jahez, with participation from Isometry Capital and existing investors like Khwarizmi Ventures and Alrajhi Partners. Founded in 2021, Soum has rapidly expanded its marketplace across Saudi Arabia, achieving significant sales growth and maintaining high customer satisfaction. The funding will support Soum's regional expansion and diversification beyond electronics, aiming to reshape the e-commerce landscape in the Middle East.",
    "fullNewsURL": "https://www.entrepreneur.com/en-ae/growth-strategies/we-got-funded-ksa-based-soum-raises-us18-million-in-a/467739"
  },
  {
    "imageURL": "https://cltarabyfa.cloudimg.io/https://cdn.soum.sa/homepage-assets/home_page_image_1.png?q=80",
    "title": "Soum, a prominent Saudi e-commerce player, completes its Series A round, raising $18 million.",
    "briefSummary": "Soum, a Saudi Arabian re-commerce platform, has raised $18 million in Series A funding led by Jahez, with participation from Isometry Capital and existing investors Khwarizmi Ventures, Alrajhi Partners, and Outliers Venture Capital. Founded in 2021, Soum has achieved rapid growth with a 40x increase in sales, focusing on expanding regionally beyond its primary market of secondhand electronics to include categories like collectibles and automobiles, aiming to capitalize on a $40 billion market opportunity.",
    "fullNewsURL": "https://www.wamda.com/2023/12/soum-raises-18-million-series-round-led-jahez"
  },
  {
    "imageURL": "https://cltarabyfa.cloudimg.io/https://cdn.soum.sa/homepage-assets/home_page_image_2.jpeg?q=80",
    "title": "سوم تغلق جولة استثمارية قدرها 67.5 مليون ريال سعودي بقيادة جاهز",
    "briefSummary": "منصة سوم، المتخصصة في بيع وشراء المنتجات المستعملة، جمعت 67.5 مليون ريال سعودي (18 مليون دولار أمريكي) في جولة استثمارية بقيادة شركة جاهز ومشاركة مستثمرين بارزين. حققت سوم نموًا كبيرًا بزيادة مبيعاتها بمقدار 40 ضعف خلال 18 شهرًا، واستحوذت على أكثر من 4 ملايين تحميل لتطبيقها في السعودية. تهدف المنصة لتسريع التوسع الإقليمي وإضافة فئات جديدة مثل المقتنيات والسيارات، مستهدفة أسواق تتجاوز قيمتها 40 مليار دولار أمريكي.",
    "fullNewsURL": "https://jawlah.co/35677"
  }
]
